Cleaning Data

In [1]:
import pandas as pd

df=pd.read_csv("raw_data.csv")
df

    id          name   age country   gender   income
0    1      John Doe  29.0     USA     Male  55000.0
1    1      John Doe  29.0     USA     Male  55000.0
2    2    Jane Smith   NaN  Canada   Female  62000.0
3    3          Alex   NaN     USA  Unknown  47000.0
4    4  Maria Garcia  34.0   Spain   Female      NaN
5    5        Li Wei  27.0   China     Male  51000.0
6    6           NaN  45.0   India   Female  73000.0
7    7    Ahmed Khan  38.0     NaN     Male  68000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0
10  10   Emily Davis  31.0     USA      NaN  58000.0

In [2]:
# handel missing value

df.isnull() # isna()- return true if value is null

# count number of missing values in column
df.isnull().sum() 

# remove null values- rows
df.dropna()

# drop columns
df.dropna(axis=1)# cols

# fill null values with some val
df.fillna(10)

# replace age col
age_mean=df["age"].mean()
df["age"].fillna(age_mean)

cleaned_data=df.copy()
age_mean=cleaned_data["age"].mean()
cleaned_data["age"]=cleaned_data["age"].fillna(age_mean)
cleaned_data


# fordward fill- copye the previouse value in next null and move forward

df.ffill()

# backward fill- coming from last and fill the prev val in null( bottom to up)

df.bfill()

    id          name   age country   gender   income
0    1      John Doe  29.0     USA     Male  55000.0
1    1      John Doe  29.0     USA     Male  55000.0
2    2    Jane Smith  34.0  Canada   Female  62000.0
3    3          Alex  34.0     USA  Unknown  47000.0
4    4  Maria Garcia  34.0   Spain   Female  51000.0
5    5        Li Wei  27.0   China     Male  51000.0
6    6    Ahmed Khan  45.0   India   Female  73000.0
7    7    Ahmed Khan  38.0     USA     Male  68000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
9    9   Carlos Ruiz  31.0  Mexico     Male  45000.0
10  10   Emily Davis  31.0     USA      NaN  58000.0

Handel Dublicate values

In [3]:
df.duplicated() # return true for duplicate values
df["country"].duplicated() # ckeck for column wise

df[["country","gender"]].duplicated()

# remove duplicates
df.drop_duplicates() # does not change original

# change the original
df2=df.copy()
df2.drop_duplicates(inplace=True)

Handel diff datatypes

In [4]:
#data types

df.dtypes

# convert the data type
df2 = df.copy()
df2 = df2.fillna(0)
df2["age"] = df2["age"].astype("int64")
print(df2.dtypes)

id           int64
name        object
age          int64
country     object
gender      object
income     float64
dtype: object

In [11]:
# date time

aqi_data=pd.read_csv("globalAirQuality.csv")
# print(aqi_data)
# convert object date time to datetime data
aqi_data["timestamp"]=pd.to_datetime(aqi_data["timestamp"])
print(aqi_data["timestamp"].dtype)

date=pd.Series(pd.to_datetime("2026-12-28"))
# print(date.dtype)

datetime64[ns]

Handel strings

In [ ]:
df["gender"].str.lower()
df["gender"].str.upper()
df["gender"].str.capitalize()

# split
df["name"].str.split(" ")

# check where the value
df["country"].str.contains("india",case=False) # does not care about case

0     False
1     False
2     False
3     False
4     False
5     False
6      True
7       NaN
8     False
9     False
10    False
Name: country, dtype: object